CSI API ETABS v1

# cAreaObjGetLoadUniform Method

---

Retrieves the uniform load assignments to area objects.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetLoadUniform(
    	string Name,
    	ref int NumberItems,
    	ref string[] AreaName,
    	ref string[] LoadPat,
    	ref string[] CSys,
    	ref int[] Dir,
    	ref double[] Value,
    	eItemType ItemType = eItemType.Objects
    )

    Function GetLoadUniform (
    	Name As String,
    	ByRef NumberItems As Integer,
    	ByRef AreaName As String(),
    	ByRef LoadPat As String(),
    	ByRef CSys As String(),
    	ByRef Dir As Integer(),
    	ByRef Value As Double(),
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim NumberItems As Integer
    Dim AreaName As String()
    Dim LoadPat As String()
    Dim CSys As String()
    Dim Dir As Integer()
    Dim Value As Double()
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.GetLoadUniform(Name,
    	NumberItems, AreaName, LoadPat, CSys,
    	Dir, Value, ItemType)

    int GetLoadUniform(
    	String^ Name,
    	int% NumberItems,
    	array<String^>^% AreaName,
    	array<String^>^% LoadPat,
    	array<String^>^% CSys,
    	array<int>^% Dir,
    	array<double>^% Value,
    	eItemType ItemType = eItemType::Objects
    )

    abstract GetLoadUniform :
            Name : string *
            NumberItems : int byref *
            AreaName : string[] byref *
            LoadPat : string[] byref *
            CSys : string[] byref *
            Dir : int[] byref *
            Value : float[] byref *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing area object or group, depending on the value of the
ItemType item.

NumberItems

    Type: SystemInt32
The total number of uniform loads retrieved for the specified area objects.

AreaName

    Type: SystemString
This is an array that includes the name of the area object associated with
each uniform load.

LoadPat

    Type: SystemString
This is an array that includes the name of the load pattern associated with
each uniform load.

CSys

    Type: SystemString
This is an array that includes the name of the coordinate system associated
with each uniform load.

Dir

    Type: SystemInt32
This is an integer between 1 and 11, indicating the direction of the load.

  1. Local 1 axis (only applies when CSys is Local)
  2. Local 2 axis (only applies when CSys is Local)
  3. Local 3 axis (only applies when CSys is Local)
  4. X direction (does not apply when CSys is Local)
  5. Y direction (does not apply when CSys is Local)
  6. Z direction (does not apply when CSys is Local)
  7. Projected X direction (does not apply when CSys is Local)
  8. Projected Y direction (does not apply when CSys is Local)
  9. Projected Z direction (does not apply when CSys is Local)
  10. Gravity direction (only applies when CSys is Global)
  11. Projected Gravity direction (only applies when CSys is Global)

The positive gravity direction (see Dir = 10 and 11) is in the negative Global
Z direction.

Value

    Type: SystemDouble
The uniform load value. [F/L^2]

ItemType (Optional)

    Type: ETABSv1eItemType
This is one of the following items in the
eItemType enumeration:

  * Object = 0
  * Group = 1
  * SelectedObjects = 2

If this item is Objects, the
assignments are retrieved for the area object specified by the Name item.

If this item is Group, the
assignments are retrieved for all area objects in the group specified by the
Name item.

If this item is SelectedObjects,
assignments are retrieved for is made to all selected area objects, and the
Name item is ignored.

#### Return Value

Type: Int32
Returns zero if the load assignments are successfully retrieved; otherwise it
returns a nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberItems As Integer
       Dim AreaName() As String
       Dim LoadPat() As String
       Dim CSys() As String
       Dim Dir() As Integer
       Dim Value() As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'assign area object uniform loads
       ret = SapModel.AreaObj.SetLoadUniform("ALL", "DEAD", -0.01, 2, False, "Local", eItemType.Group)

    'get area object uniform load
       ret = SapModel.AreaObj.GetLoadUniform("3", NumberItems, AreaName, LoadPat, CSys, Dir, Value)

    'refresh view
       ret = SapModel.View.RefreshView(0, False)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com